Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00064.PIC
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0DIRTGL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4000320C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="DIRTGL" edc:nzwidth="0x20" edc:desc="Port Data Direction Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0OUT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40003210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="OUT" edc:nzwidth="0x20" edc:desc="PORT Data Output Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0OUTCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40003214">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="OUTCLR" edc:nzwidth="0x20" edc:desc="PORT Data Output Value Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0OUTSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40003218">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="OUTSET" edc:nzwidth="0x20" edc:desc="PORT Data Output Value Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0OUTTGL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4000321C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="OUTTGL" edc:nzwidth="0x20" edc:desc="PORT Data Output Value Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0IN" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40003220">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="IN" edc:nzwidth="0x20" edc:desc="PORT Data Input Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0CTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40003224">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="SAMPLING" edc:nzwidth="0x20" edc:desc="Input Sampling Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0WRCONFIG" edc:nzwidth="0x20" edc:access="ww-wwwww-w---wwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xDF47FFFF" edc:_addr="0x40003228">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PINMASK" edc:nzwidth="0x10" edc:desc="Pin Mask for Multiple Pin Configuration"/>
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PMUX" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing"/>
            <edc:SFRFieldDef edc:cname="WRPMUX" edc:nzwidth="0x1" edc:desc="Write PMUX"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRPINCFG" edc:nzwidth="0x1" edc:desc="Write PINCFG"/>
            <edc:SFRFieldDef edc:cname="HWSEL" edc:nzwidth="0x1" edc:desc="Half-Word Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0EVCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4000322C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PID0" edc:nzwidth="0x5" edc:desc="PORT Event Pin Identifier 0"/>
            <edc:SFRFieldDef edc:cname="EVACT0" edc:nzwidth="0x2" edc:desc="PORT Event Action 0">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Event output to pin" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set output register of pin on event" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLR" edc:desc="Clear output register of pin on event" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TGL" edc:desc="Toggle output register of pin on event" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PORTEI0" edc:nzwidth="0x1" edc:desc="PORT Event Input Enable 0"/>
            <edc:SFRFieldDef edc:cname="PID1" edc:nzwidth="0x5" edc:desc="PORT Event Pin Identifier 1"/>
            <edc:SFRFieldDef edc:cname="EVACT1" edc:nzwidth="0x2" edc:desc="PORT Event Action 1"/>
            <edc:SFRFieldDef edc:cname="PORTEI1" edc:nzwidth="0x1" edc:desc="PORT Event Input Enable 1"/>
            <edc:SFRFieldDef edc:cname="PID2" edc:nzwidth="0x5" edc:desc="PORT Event Pin Identifier 2"/>
            <edc:SFRFieldDef edc:cname="EVACT2" edc:nzwidth="0x2" edc:desc="PORT Event Action 2"/>
            <edc:SFRFieldDef edc:cname="PORTEI2" edc:nzwidth="0x1" edc:desc="PORT Event Input Enable 2"/>
            <edc:SFRFieldDef edc:cname="PID3" edc:nzwidth="0x5" edc:desc="PORT Event Pin Identifier 3"/>
            <edc:SFRFieldDef edc:cname="EVACT3" edc:nzwidth="0x2" edc:desc="PORT Event Action 3"/>
            <edc:SFRFieldDef edc:cname="PORTEI3" edc:nzwidth="0x1" edc:desc="PORT Event Input Enable 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PMUX0" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40003230">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Even-Numbered Pin">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PMUX1" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40003231">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Even-Numbered Pin">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
