Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00064.PIC
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="NSCHKUSER1" edc:nzwidth="0x20" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFF" edc:_addr="0x420001F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER32" edc:nzwidth="0x1" edc:desc="User 32 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER33" edc:nzwidth="0x1" edc:desc="User 33 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER34" edc:nzwidth="0x1" edc:desc="User 34 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER35" edc:nzwidth="0x1" edc:desc="User 35 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER36" edc:nzwidth="0x1" edc:desc="User 36 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER37" edc:nzwidth="0x1" edc:desc="User 37 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER38" edc:nzwidth="0x1" edc:desc="User 38 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER39" edc:nzwidth="0x1" edc:desc="User 39 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER40" edc:nzwidth="0x1" edc:desc="User 40 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER41" edc:nzwidth="0x1" edc:desc="User 41 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER42" edc:nzwidth="0x1" edc:desc="User 42 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER43" edc:nzwidth="0x1" edc:desc="User 43 to be checked as non-secured "/>
            <edc:SFRFieldDef edc:cname="USER44" edc:nzwidth="0x1" edc:desc="User 44 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER45" edc:nzwidth="0x1" edc:desc="User 45 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER46" edc:nzwidth="0x1" edc:desc="User 46 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER47" edc:nzwidth="0x1" edc:desc="User 47 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER48" edc:nzwidth="0x1" edc:desc="User 48 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER49" edc:nzwidth="0x1" edc:desc="User 49 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER50" edc:nzwidth="0x1" edc:desc="User 50 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER51" edc:nzwidth="0x1" edc:desc="User 51 to be checked as non-secured"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x420001F8"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-------w" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x42000200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x42000201"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="SWEVT" edc:nzwidth="0x20" edc:access="--------------------wwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x42000204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:nzwidth="0x1" edc:desc="Channel 0 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:nzwidth="0x1" edc:desc="Channel 1 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:nzwidth="0x1" edc:desc="Channel 2 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:nzwidth="0x1" edc:desc="Channel 3 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:nzwidth="0x1" edc:desc="Channel 4 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:nzwidth="0x1" edc:desc="Channel 5 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:nzwidth="0x1" edc:desc="Channel 6 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:nzwidth="0x1" edc:desc="Channel 7 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL8" edc:nzwidth="0x1" edc:desc="Channel 8 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL9" edc:nzwidth="0x1" edc:desc="Channel 9 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL10" edc:nzwidth="0x1" edc:desc="Channel 10 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL11" edc:nzwidth="0x1" edc:desc="Channel 11 Software Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="PRICTRL" edc:nzwidth="0x8" edc:access="n----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x87" edc:_addr="0x42000208">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="PRI" edc:nzwidth="0x3" edc:desc="Channel Priority Number"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RREN" edc:nzwidth="0x1" edc:desc="Round-Robin Scheduling Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x7" edc:_addr="0x42000209"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTPEND" edc:nzwidth="0x10" edc:access="nn----nn-----nnn" edc:por="0100000000000000" edc:mclr="0100000000000000" edc:impl="0xC307" edc:_addr="0x42000210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x3" edc:desc="Channel ID"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="OVR" edc:nzwidth="0x1" edc:desc="Channel Overrun"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:nzwidth="0x1" edc:desc="Channel Event Detected"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="READY" edc:nzwidth="0x1" edc:desc="Ready"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
