Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00064.PIC
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x42004C16"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="SYNCBUSY" edc:nzwidth="0x10" edc:access="------rr--rrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x33F" edc:_addr="0x42004C18">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="CKEN0" edc:nzwidth="0x1" edc:desc="Clock Unit 0 Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="CKEN1" edc:nzwidth="0x1" edc:desc="Clock Unit 1 Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Tx Serializer Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Rx Serializer Enable Synchronization Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXDATA" edc:nzwidth="0x1" edc:desc="Tx Data Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="RXDATA" edc:nzwidth="0x1" edc:desc="Rx Data Synchronization Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x42004C1A"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="TXCTRL" edc:nzwidth="0x20" edc:access="------nnnnnnnnnnnnnn-nnnn--nnn--" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFF79C" edc:_addr="0x42004C20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXDEFAULT" edc:nzwidth="0x2" edc:desc="Line Default Line when Slot Disabled">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Output Default Value is 0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="Output Default Value is 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HIZ" edc:desc="Output Default Value is high impedance" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXSAME" edc:nzwidth="0x1" edc:desc="Transmit Data when Underrun">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Zero data transmitted in case of underrun" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SAME" edc:desc="Last data transmitted in case of underrun" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SLOTADJ" edc:nzwidth="0x1" edc:desc="Data Slot Formatting Adjust">
              <edc:SFRFieldSemantic edc:cname="RIGHT" edc:desc="Data is right adjusted in slot" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LEFT" edc:desc="Data is left adjusted in slot" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATASIZE" edc:nzwidth="0x3" edc:desc="Data Word Size">
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24 bits" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="20" edc:desc="20 bits" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="18" edc:desc="18 bits" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 bits" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="16C" edc:desc="16 bits compact stereo" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 bits" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="8C" edc:desc="8 bits compact stereo" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WORDADJ" edc:nzwidth="0x1" edc:desc="Data Word Formatting Adjust">
              <edc:SFRFieldSemantic edc:cname="RIGHT" edc:desc="Data is right adjusted in word" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LEFT" edc:desc="Data is left adjusted in word" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXTEND" edc:nzwidth="0x2" edc:desc="Data Formatting Bit Extension">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Extend with zeroes" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="Extend with ones" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MSBIT" edc:desc="Extend with Most Significant Bit" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LSBIT" edc:desc="Extend with Least Significant Bit" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITREV" edc:nzwidth="0x1" edc:desc="Data Formatting Bit Reverse">
              <edc:SFRFieldSemantic edc:cname="MSBIT" edc:desc="Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LSBIT" edc:desc="Transfer Data Least Significant Bit (LSB) first" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLOTDIS0" edc:nzwidth="0x1" edc:desc="Slot 0 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS1" edc:nzwidth="0x1" edc:desc="Slot 1 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS2" edc:nzwidth="0x1" edc:desc="Slot 2 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS3" edc:nzwidth="0x1" edc:desc="Slot 3 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS4" edc:nzwidth="0x1" edc:desc="Slot 4 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS5" edc:nzwidth="0x1" edc:desc="Slot 5 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS6" edc:nzwidth="0x1" edc:desc="Slot 6 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS7" edc:nzwidth="0x1" edc:desc="Slot 7 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="MONO" edc:nzwidth="0x1" edc:desc="Mono Mode">
              <edc:SFRFieldSemantic edc:cname="STEREO" edc:desc="Normal mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MONO" edc:desc="Left channel data is duplicated to right channel" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMA" edc:nzwidth="0x1" edc:desc="Single or Multiple DMA Channels">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single DMA channel" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE" edc:desc="One DMA channel per data channel" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="RXCTRL" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnnnnnn-nnnn-n---nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF7A3" edc:_addr="0x42004C24">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SERMODE" edc:nzwidth="0x2" edc:desc="Serializer Mode">
              <edc:SFRFieldSemantic edc:cname="RX" edc:desc="Receive" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PDM2" edc:desc="Receive one PDM data on each serial clock edge" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:nzwidth="0x1" edc:desc="Clock Unit Selection">
              <edc:SFRFieldSemantic edc:cname="CLK0" edc:desc="Use Clock Unit 0" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK1" edc:desc="Use Clock Unit 1" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOTADJ" edc:nzwidth="0x1" edc:desc="Data Slot Formatting Adjust">
              <edc:SFRFieldSemantic edc:cname="RIGHT" edc:desc="Data is right adjusted in slot" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LEFT" edc:desc="Data is left adjusted in slot" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATASIZE" edc:nzwidth="0x3" edc:desc="Data Word Size">
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24 bits" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="20" edc:desc="20 bits" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="18" edc:desc="18 bits" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 bits" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="16C" edc:desc="16 bits compact stereo" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 bits" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="8C" edc:desc="8 bits compact stereo" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WORDADJ" edc:nzwidth="0x1" edc:desc="Data Word Formatting Adjust">
              <edc:SFRFieldSemantic edc:cname="RIGHT" edc:desc="Data is right adjusted in word" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LEFT" edc:desc="Data is left adjusted in word" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXTEND" edc:nzwidth="0x2" edc:desc="Data Formatting Bit Extension">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Extend with zeroes" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="Extend with ones" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MSBIT" edc:desc="Extend with Most Significant Bit" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LSBIT" edc:desc="Extend with Least Significant Bit" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITREV" edc:nzwidth="0x1" edc:desc="Data Formatting Bit Reverse">
              <edc:SFRFieldSemantic edc:cname="MSBIT" edc:desc="Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LSBIT" edc:desc="Transfer Data Least Significant Bit (LSB) first" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLOTDIS0" edc:nzwidth="0x1" edc:desc="Slot 0 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS1" edc:nzwidth="0x1" edc:desc="Slot 1 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS2" edc:nzwidth="0x1" edc:desc="Slot 2 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS3" edc:nzwidth="0x1" edc:desc="Slot 3 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS4" edc:nzwidth="0x1" edc:desc="Slot 4 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS5" edc:nzwidth="0x1" edc:desc="Slot 5 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS6" edc:nzwidth="0x1" edc:desc="Slot 6 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS7" edc:nzwidth="0x1" edc:desc="Slot 7 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="MONO" edc:nzwidth="0x1" edc:desc="Mono Mode">
              <edc:SFRFieldSemantic edc:cname="STEREO" edc:desc="Normal mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MONO" edc:desc="Left channel data is duplicated to right channel" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMA" edc:nzwidth="0x1" edc:desc="Single or Multiple DMA Channels">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single DMA channel" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE" edc:desc="One DMA channel per data channel" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXLOOP" edc:nzwidth="0x1" edc:desc="Loop-back Test Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x42004C28"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="TXDATA" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42004C30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Sample Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="RXDATA" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42004C34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Sample Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3C8" edc:_addr="0x42004C38"/>
      <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="n-----nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x83" edc:_addr="0x42005000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LPMUX" edc:nzwidth="0x1" edc:desc="Low-Power Mux"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x42005001"/>
      <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="-----rrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42005002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:SFRFieldDef edc:cname="READY0" edc:nzwidth="0x1" edc:desc="OPAMP 0 Ready"/>
            <edc:SFRFieldDef edc:cname="READY1" edc:nzwidth="0x1" edc:desc="OPAMP 1 Ready"/>
            <edc:SFRFieldDef edc:cname="READY2" edc:nzwidth="0x1" edc:desc="OPAMP 2 Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x42005003"/>
      <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="OPAMPCTRL0" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFE" edc:_addr="0x42005004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Operational Amplifier Enable"/>
            <edc:SFRFieldDef edc:cname="ANAOUT" edc:nzwidth="0x1" edc:desc="Analog Output"/>
            <edc:SFRFieldDef edc:cname="BIAS" edc:nzwidth="0x2" edc:desc="Bias Selection">
              <edc:SFRFieldSemantic edc:cname="MODE0" edc:desc="Minimum current consumption, but the slowest mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="Low current consumption, slow speed" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="High current consumption, fast speed" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Maximum current consumption, but the fastest mode" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RES2VCC" edc:nzwidth="0x1" edc:desc="Resistor ladder To VCC"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="RES2OUT" edc:nzwidth="0x1" edc:desc="Resistor ladder To Output"/>
            <edc:SFRFieldDef edc:cname="RES1EN" edc:nzwidth="0x1" edc:desc="Resistor 1 Enable"/>
            <edc:SFRFieldDef edc:cname="RES1MUX" edc:nzwidth="0x3" edc:desc="Resistor 1 Mux">
              <edc:SFRFieldSemantic edc:cname="OA0POS" edc:desc="OPAMP0 Positive Input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OA0NEG" edc:desc="OPAMP0 Negative Input" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DAC_REFBUF" edc:desc="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AVSS" edc:desc="Ground" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="RG_CONN" edc:desc="RG_CONN" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POTMUX" edc:nzwidth="0x3" edc:desc="Potentiometer Selection">
              <edc:SFRFieldSemantic edc:cname="14R_2R" edc:desc="R1 = 14R, R2 = 2R" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="12R_4R" edc:desc="R1 = 12R, R2 = 4R" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="8R_8R" edc:desc="R1 = 8R, R2 = 8R" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="6R_10R" edc:desc="R1 = 6R, R2 = 10R" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="4R_12R" edc:desc="R1 = 4R, R2 = 12R" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="3R_13R" edc:desc="R1 = 3R, R2 = 13R" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="2R_14R" edc:desc="R1 = 2R, R2 = 14R" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="R_15R" edc:desc="R1 = 1R, R2 = 15R" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x4" edc:desc="Positive Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="OA0POS" edc:desc="OPAMP0 Positive Input" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OA0TAP" edc:desc="OPAMP0 Resistor ladder taps" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DAC_REFBUF" edc:desc="REFERENCE or DAC VOUT0 Output" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AVSS" edc:desc="Ground" edc:when="(field &amp; 0xF) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:nzwidth="0x4" edc:desc="Negative Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="OA0NEG" edc:desc="OPAMP0 Negative Input" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OA0TAP" edc:desc="OPAMP0 Resistor ladder taps" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DAC_REFBUF" edc:desc="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OA0OUT" edc:desc="OPAMP0 Output" edc:when="(field &amp; 0xF) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
