Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00064.PIC
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="SHCSR" edc:nzwidth="0x20" edc:access="----------n-----n---nn--n-n--n--" edc:impl="0x208CA4" edc:_addr="0xE000ED24">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HARDFAULTACT" edc:nzwidth="0x1" edc:desc="HardFault exception active state"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NMIACT" edc:nzwidth="0x1" edc:desc="NMI exception active state"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVCALLACT" edc:nzwidth="0x1" edc:desc="SVCall exception active state"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PENDSVACT" edc:nzwidth="0x1" edc:desc="PendSV exception active state"/>
            <edc:SFRFieldDef edc:cname="SYSTICKACT" edc:nzwidth="0x1" edc:desc="SysTick exception active state"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SVCALLPENDED" edc:nzwidth="0x1" edc:desc="SVCall exception pended state"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="HARDFAULTPENDED" edc:nzwidth="0x1" edc:desc="HardFault exception pended state"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE000ED28"/>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="DFSR" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0xE000ED30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="HALTED" edc:nzwidth="0x1" edc:desc="Halt or step event"/>
            <edc:SFRFieldDef edc:cname="BKPT" edc:nzwidth="0x1" edc:desc="Breakpoint event"/>
            <edc:SFRFieldDef edc:cname="DWTTRAP" edc:nzwidth="0x1" edc:desc="Watchpoint event"/>
            <edc:SFRFieldDef edc:cname="VCATCH" edc:nzwidth="0x1" edc:desc="Vector Catch event"/>
            <edc:SFRFieldDef edc:cname="EXTERNAL" edc:nzwidth="0x1" edc:desc="External event"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE000ED34"/>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="AFSR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000ED3C"/>
      <edc:AdjustPoint edc:offset="0x38" edc:_addr="0xE000ED40"/>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CLIDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED78">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="Ctype1" edc:nzwidth="0x3" edc:desc="Cache type at level 1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype2" edc:nzwidth="0x3" edc:desc="Cache type at level 2">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype3" edc:nzwidth="0x3" edc:desc="Cache type at level 3">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype4" edc:nzwidth="0x3" edc:desc="Cache type at level 4">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype5" edc:nzwidth="0x3" edc:desc="Cache type at level 5">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype6" edc:nzwidth="0x3" edc:desc="Cache type at level 6">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype7" edc:nzwidth="0x3" edc:desc="Cache type at level 7">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LoUIS" edc:nzwidth="0x3" edc:desc="Level of Unification Inner Shareable"/>
            <edc:SFRFieldDef edc:cname="LoC" edc:nzwidth="0x3" edc:desc="Level of Coherence"/>
            <edc:SFRFieldDef edc:cname="LoUU" edc:nzwidth="0x3" edc:desc="Level of Unification Uniprocessor"/>
            <edc:SFRFieldDef edc:cname="ICB" edc:nzwidth="0x2" edc:desc="Inner cache boundary">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Not disclosed in this mechanism" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="L1" edc:desc="L1 cache is the highest inner level" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="L2" edc:desc="L2 cache is the highest inner level" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="L3" edc:desc="L3 cache is the highest inner level" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CTR" edc:nzwidth="0x20" edc:access="rrr-rrrrrrrrrrrr------------rrrr" edc:impl="0xEFFF000F" edc:_addr="0xE000ED7C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="IminLine" edc:nzwidth="0x4" edc:desc="Instruction cache minimum line length"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DminLine" edc:nzwidth="0x4" edc:desc="Data cache minimum line length"/>
            <edc:SFRFieldDef edc:cname="ERG" edc:nzwidth="0x4" edc:desc="Exclusives Reservation Granule"/>
            <edc:SFRFieldDef edc:cname="CWG" edc:nzwidth="0x4" edc:desc="Cache Write-back Granule"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Format" edc:nzwidth="0x3" edc:desc="Cache Type Register format">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache type information provided" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Cache type information is provided" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CCSIDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="LineSize" edc:nzwidth="0x3" edc:desc="log2(number of words per line) - 2"/>
            <edc:SFRFieldDef edc:cname="Associativity" edc:nzwidth="0xA" edc:desc="Associativity - 1"/>
            <edc:SFRFieldDef edc:cname="NumSets" edc:nzwidth="0xF" edc:desc="Number of sets - 1"/>
            <edc:SFRFieldDef edc:cname="WA" edc:nzwidth="0x1" edc:desc="Write-Allocate"/>
            <edc:SFRFieldDef edc:cname="RA" edc:nzwidth="0x1" edc:desc="Read-Allocate"/>
            <edc:SFRFieldDef edc:cname="WB" edc:nzwidth="0x1" edc:desc="Write-Back"/>
            <edc:SFRFieldDef edc:cname="WT" edc:nzwidth="0x1" edc:desc="Write-Through"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
